#####################################################################
#     ____       ____  _________    ____  ____  __________________  #
#    / __ \_  __/ __ \/ ____/   |  / __ \/ __ )/ ____/ ____/ ____/  #
#   / / / / |/_/ / / / __/ / /| | / / / / __  / __/ / __/ / /       #
#  / /_/ />  </ /_/ / /___/ ___ |/ /_/ / /_/ / /___/ /___/ __/      #
#  \____/_/|_/_____/_____/_/  |_/_____/_____/_____/_____/_/         #
#                                                                   #
#####################################################################

import re


def clean(word):
    whitelist = set('aábcdefgǵhijklmnńoópqrstuúvwxyýz аәбвгґғдеэєёжзиіїйкқлмнңоөпрстуўұүфхцчшщъыьюя')
    return ''.join(filter(whitelist.__contains__, word))

def lintResponse(response):
    # phrase = re.sub('([Xx]|\>\<|\)\()', 'х', phrase)
    # phrase = re.sub('([Oo0]|\(\))', 'о', phrase)
    # phrase = re.sub(r'\/\\|JI', 'л', phrase)
    return response